#+TITLE: Backpropagation
#+LANGUAGE: de
#+EXPORT_FILE_NAME: docs/index.html

** Notation
#+BEGIN_SRC python :exports both :results output
for i in range(5):
    print(i)
#+END_SRC

#+RESULTS:
: 0
: 1
: 2
: 3
: 4

*** Beispiel
Funktion $f(x)=x^2-y^2$ ist gegeben.

#+begin_org
$1+1$
#+end_org

#+BEGIN_SRC jupyter-python :session py :display text/latex :output both :results raw :wrap EXPORT html
%config InlineBackend.figure_format = 'retina'
import matplotlib.pyplot as plt
import numpy as np
import sympy as sp
from sympy import latex
sp.init_printing()

x, y = sp.symbols('x, y', real=True)
F = sp.Matrix([x**2-y**2])
J = F.jacobian(sp.Matrix([x, y]))
J
#+END_SRC

#+RESULTS:
#+begin_EXPORT html
$\displaystyle \left[\begin{matrix}2 x & - 2 y\end{matrix}\right]$
#+end_EXPORT


